reports/09-run-laptop/ab_python.log
$ ab -n 1000000 -g python.tsv -c 8 192.168.1.211:8000/contacts/1                                                                                             
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>                                                                                                                                                            
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/                                                                                                                                           
Licensed to The Apache Software Foundation, http://www.apache.org/                                                                                                                                                 
                                                                                                                                                                                                                   
Benchmarking 192.168.1.211 (be patient)                                                                                                                                                                            
Completed 100000 requests                                                                                                                                                                                          
Completed 200000 requests                                                                                                                                                                                          
Completed 300000 requests                                                                                                                                                                                          
Completed 400000 requests                                                                                                                                                                                          
Completed 500000 requests                                                                                                                                                                                          
Completed 600000 requests                                                                                                                                                                                          
Completed 700000 requests                                                                                                                                                                                          
Completed 800000 requests                                                                                                                                                                                          
Completed 900000 requests                                                                                                                                                                                          
Completed 1000000 requests
Finished 1000000 requests


Server Software:        uvicorn
Server Hostname:        192.168.1.211
Server Port:            8000

Document Path:          /contacts/1
Document Length:        87 bytes

Concurrency Level:      8
Time taken for tests:   333.118 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      212000000 bytes
HTML transferred:       87000000 bytes
Requests per second:    3001.94 [#/sec] (mean)
Time per request:       2.665 [ms] (mean)
Time per request:       0.333 [ms] (mean, across all concurrent requests)
Transfer rate:          621.49 [Kbytes/sec] received 

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.1      1      11
Processing:     1    2   0.5      2      25
Waiting:        1    2   0.5      2      25
Total:          1    3   0.5      3      26

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      3
  98%      4
  99%      4
 100%     26 (longest request)